<?php

namespace App\Database\Seeds;

use CodeIgniter\Database\Seeder;

class University extends Seeder
{
    public function run()
    {
        $data = [
            ['uni_name' => 'جامعة أم القرى', 'uni_reg' => 'في مكة المكرمة سنة 1369هـ'],
            ['uni_name' => 'الجامعة الإسلامية', 'uni_reg' => 'في المدينة المنورة سنة 1381هـ'],
            ['uni_name' => 'جامعة الإمام محمد بن سعود الإسلامية', 'uni_reg' => 'في الرياض سنة 1373 هـ'],
            ['uni_name' => 'جامعة الملك عبد العزيز', 'uni_reg' => 'في جدة سنة 1387هـ'],
            ['uni_name' => 'جامعة الملك سعود', 'uni_reg' => 'في الرياض سنة 1377هـ'],
            ['uni_name' => 'جامعة الملك فهد للبترول والمعادن', 'uni_reg' => 'في الظهران سنة 1384 هـ'],
            ['uni_name' => 'جامعة نايف العربية للعلوم الأمنية', 'uni_reg' => 'في الرياض سنة 1400 هـ'],
            ['uni_name' => 'جامعة الملك فيصل', 'uni_reg' => 'في الإحساء سنة 1395 هـ'],
            ['uni_name' => 'جامعة الملك خالد', 'uni_reg' => 'في أبها سنة 1420 هـ'],
            ['uni_name' => 'جامعة القصيم', 'uni_reg' => 'في القصيم سنة 1423 هـ'],
            ['uni_name' => 'جامعة طيبة', 'uni_reg' => 'في المدينة المنورة سنة 1424 هـ'],
            ['uni_name' => 'جامعة الطائف', 'uni_reg' => 'في الطائف سنة 1423 هـ'],
            ['uni_name' => 'جامعة حائل', 'uni_reg' => 'في حائل سنة 1426 هـ'],
            ['uni_name' => 'جامعة جازان', 'uni_reg' => 'في جازان سنة 1426 هـ'],
            ['uni_name' => 'جامعة الجوف', 'uni_reg' => 'بين سكاكا ودومة الجندل سنة 1426 هـ'],
            ['uni_name' => 'جامعة الباحة', 'uni_reg' => 'في الباحة سنة 1426 هـ'],
            ['uni_name' => 'جامعة تبوك', 'uni_reg' => 'في تبوك سنة 1427 هـ'],
            ['uni_name' => 'جامعة نجران', 'uni_reg' => 'في نجران سنة 1427 هـ'],
            ['uni_name' => 'جامعة الحدود الشمالية', 'uni_reg' => 'في عرعر سنة 1428 هـ'],
            ['uni_name' => 'جامعة الأميرة نورة بنت عبد الرحمن', 'uni_reg' => 'في الرياض سنة 1427 هـ'],
            ['uni_name' => 'جامعة الملك سعود بن عبد العزيز للعلوم الصحية', 'uni_reg' => 'في الرياض سنة 1426 هـ'],
            ['uni_name' => 'جامعة الإمام عبد الرحمن بن فيصل', 'uni_reg' => 'في الدمام سنة 1430 هـ'],
            ['uni_name' => 'جامعة الملك عبد الله للعلوم والتقنية', 'uni_reg' => 'في ثول سنة 2009'],
            ['uni_name' => 'جامعة الأمير سطام بن عبد العزيز', 'uni_reg' => 'في الخرج سنة 1430 هـ'],
            ['uni_name' => 'جامعة شقراء', 'uni_reg' => 'في شقراء سنة 1430 هـ'],
            ['uni_name' => 'جامعة المجمعة', 'uni_reg' => 'في المجمعة سنة 1432 هـ'],
            ['uni_name' => 'الجامعة السعودية الالكترونية', 'uni_reg' => 'في الرياض سنة 1432 هـ'],
            ['uni_name' => 'جامعة جدة', 'uni_reg' => 'في جدة سنة 1434 هـ'],
            ['uni_name' => 'جامعة بيشة', 'uni_reg' => 'في بيشة سنة 1435 هـ'],
            ['uni_name' => 'كلية المدربين التقنيين', 'uni_reg' => 'في الرياض سنة 2009'],
            ['uni_name' => 'جامعة حفر الباطن', 'uni_reg' => 'في حفر الباطن سنة 1435 هـ'],
            ['uni_name' => 'كلية الجبيل الصناعية', 'uni_reg' => 'في الجبيل الصناعية سنة 1978'],
            ['uni_name' => 'كلية ينبع الصناعية', 'uni_reg' => 'في ينبع الصناعية سنة 1989'],
            ['uni_name' => 'كلية ينبع الجامعية', 'uni_reg' => 'في ينبع الصناعية سنة 2005'],
        ];
        foreach ($data as $dt) {
            $this->db->table('universities')->insert($dt);
        }
    }
}
